import express from "express";

const app = express();

// app.get('/', (req, res) => {
//     res.send('server is Ready');
// });


// get a list of 5 quotes

app.get('/api/quotes', (req, res) => {
    const quotes = [
        {
            id: 1,
            title:'चाणक्य-',
            content: 'ब्रह्माज्ञानी को स्वर्ग तृण है, शूर को जीवन तृण है, जिसने इंद्रियों को वश में किया उसको स्त्री तृण-तुल्य जान पड़ती है, निस्पृह को जगत तृण है'
        },
        {
            id: 2,
            title:'विदुर-',
            content: 'कुमंत्रणा से राजा का, कुसंगति से साधु का, अत्यधिक दुलार से पुत्र का और अविद्या से ब्राह्मण का नाश होता है।'
        },
        {
            id: 3,
            title:'अटल बिहारी वाजपेयी-',
            content: 'लक्ष्य के लिए की गई कड़ी मेहनत कभी भी आप पर थकान नहीं लाती, वो आपके लिए संतोष ही लाती है।'
        },
        {
            id: 4,
            title:'रतन टाटा-',
            content: 'मैं कभी भी सही निर्णय लेने पर विश्वास नहीं करता। मैं निर्णय ले कर, उसे सही साबित करने में विश्वास करता हूं। '
        },
        {
            id: 5,
            title:'स्वामी विवेकानंद-',
            content: 'ब्रह्माण्ड की सारी शक्तियां पहले से हमारी हैं. वो हमीं हैं जो अपनी आँखों पर हाँथ रख लेते हैं और फिर रोते हैं कि कितना अन्धकार है!'
        }
    ];
    res.send(quotes);
})



const port = process.env.PORT || 3000;

app.listen(port, () => {
    console.log(`Serve at http://localhost:${port}`);
})